[
    {
        "reviews": [
            {
                "review_header": "One Star", 
                "review_text": "I bought 2 iPhones with this seller, both have problems and I can't return them.", 
                "review_comment_count": "2", 
                "review_posted_date": "26 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Beca Wilkerson"
            }, 
            {
                "review_header": "Severly scratched and dented, won't even turned on.", 
                "review_text": "I don't know what they called certified refurbished, but all i received was a severly dented and scratched phone with a new screen. Also, it won't even turn on! DON'T BUY AND WASTE YOUR TIME OR MONEY ON THIS.", 
                "review_comment_count": "2", 
                "review_posted_date": "01 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Thanks for the STOLEN phone.", 
                "review_text": "The phone was in okay shape. Some dings around the camera area but it was marked STOLEN when we tried to activate it. Haven't been able to activate it yet but we will keep you posted.", 
                "review_comment_count": "6", 
                "review_posted_date": "18 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " B Lowr"
            }, 
            {
                "review_header": "AVOID", 
                "review_text": "I ordered the iPhone 6 64 gigabyte and looking through the package, the iPhone is freaking bent. Wasted my time and money. AVOID LIKE HERPES", 
                "review_comment_count": "", 
                "review_posted_date": "28 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " wheredidileavemycell"
            }, 
            {
                "review_header": "One Star", 
                "review_text": "box came empty", 
                "review_comment_count": "1", 
                "review_posted_date": "13 May 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "PISSED", 
                "review_text": "Dont waste your time! They sent me a locked phone that I can't even use!!! It literally says unlocked in the description but my phone is VERY LOCKED. I can't get it turned on..", 
                "review_comment_count": "", 
                "review_posted_date": "19 Mar 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Phone constantly crashes. Battery is junk. Sold me ...", 
                "review_text": "Phone constantly crashes. Battery is junk. Sold me a piece of junk and I want my money back. Don't buy. Spend the extra cash and go through a decent company", 
                "review_comment_count": "", 
                "review_posted_date": "12 Apr 2017", 
                "review_rating": "1.0 ", 
                "review_author": " sawyer"
            }, 
            {
                "review_header": "No iphone", 
                "review_text": "I got this iPhone 6, open the box and there was the accesorios but no iphone. I'm very disappointed", 
                "review_comment_count": "19", 
                "review_posted_date": "21 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "31%", 
            "4 star": "11%", 
            "3 star": "6%", 
            "5 star": "46%"
        }, 
        "price": "$278.98", 
        "url": "http://www.amazon.com/dp/B00YD547Q6", 
        "name": "Apple iPhone 6 16GB Unlocked GSM Smartphone - Space Gray (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "A mostly positive and detailed review.", 
                "review_text": "After owning the phone long enough to be familiar with it, I thought I would leave a decent review outlining some of the pro's and con's, as well as some neutral's. My review is as follows: (see end comments about unlocked and verizon use - this phone is 100% unlocked!) Pro's: 1. Very sleek design. Very nice screen and overall a great phone. 2. The camera/video recorder is AMAZING. Simple as that. I took amazing outdoor and indoor (even in low light/no light) pictures. I am genuinely impressed and was not expecting it to be so good. (See last pic. Photo on phone was taken by s8) 3. The pixel ratio/screen size. I got the s8 because I did not want a huge computer in my pocket, and it has plenty of room in it. 4. Very fast. The processor even with battery settings set to a mid level (which can be changed to your personal preference) is still fast enough to do anything you can throw at it. 5. RAM and Storage ration. Perfect. Plenty of ram to handle multi-tasking and plenty of storage to handle those 4k videos/pictures PLUS room to expand with SD storage, which is also getting much better and bigger. But 64GB entry level... eat your heart out apple. 6. Great speaker! I mean wow... this thing get's loud. I was also not expecting such great sound. You will have no trouble hearing anything even in a loud environment. Seriously amazed here. 7. Power saving/Battery life. Simply put, the AMOLED allows for some amazing battery life and the 3000mah batter holds up well. Very well. Much better than the iPhone. 8. Fast charging. The lowest I have had the battery is about 60% and it charged in under an hour. 9. AMOLED screen. As stated in #7, it helps with battery life but other than that, it has plenty of brightness and picture clarity. I also carified in #3 that the screen size and pixel ratio were simply stunning. You will notice this if you game alot or during those 4k picture zooms and probably much more on the s8+. 10. Accessories and headphone jack. It has a headphone jack! lol. The accessories that came with the phone are great. A fast charging cable, a type-c to mini usb extension, and a usb to type-c extension as well. The headphones are simply amazing too. By far some of the best I have owned, as far as ear buds go, and you don't have to pay for good quality here. The material of them is great and they come with extra different size earbuds. 11. Water resistance. While I have not tested it, and probably never will, it's a great feature. I still don't recommend dunking your phone. 12. Pocket settings. There is an option to keep the screen off while in your pocket, or something like a purse. Simple as that. If you butt dial, you probably are not navigating the settings well enough. Keep in mind, android has A LOT of settings, and it would be wise to go through them all including the basic options that samsung offers. 13. Widget size. You can actually adjust the size of every single widget, and fit more apps on the pages as well as the default home row. You can also change the lock screen apps, if you want any at all. I personally have a camera and the phone app on the lock screen, and keep all my apps on a single page, in folders, the weather, a google search bar with the mic button, and lastly a control panel for quick access to bluetooth and auto-sync buttons etc etc.. All on one page, with plenty of empty space. Half the screen is even still empty. Thank you so much for resizeable widgets. Neutral: 1. Bixby button. The button is below the volume buttons, so nothing you can do there. However, you can disable bixby. Most reviews on here are failing to realize this and also failing to outline how. See the end of my review for simple instructions. 2. Phone Length. I'll admit, it's pretty long. Maybe I am just to used to an older, smaller phone, but one handed operations is going to take some getting used to. Be mindful of the edges of the screen too. Too much palm and you will be scrolling. I do not see this as a negative still, just takes some getting used to and as outlined in the pro's section, the overall screen size is perfect. 3. Edge lighting. A bit torn on this one. It seems cool, but is pretty much useless. It's basically a notification before the notification. So you would have to tap twice and then unlock as well. IMHO, it does look really cool, but SAMSUNG needs to give us more control over it. 4. Always on display. This can also be turned off. I find it 100% useless, but not a negative by any means. I feel it can definitely cater to some users who enjoy always being able to look at their phone. I personally disabled it and honestly looked no further into it. 5. Color settings. I have always disliked samsung's default colors. Especially on TV's. However, there is an option to change them to your liking. I chose the basic setting, but there is even an option to change balance which let's you arrange a set of liked color boxes, whites, and blacks to your liking and all kinds of other options for personal preference. It really is a great setting, however, it is a neutral and not a pro simply because they enable a very rich color by default. So I recommend changing this to suite your own eyeballs. 6. The lock screen clock/theme settings. In order to change the lock screen clock, you have to register with samsung themes and install a theme, which can be somewhat custom. I did this, and the deactivated my account. The setting were retained and all is well. Still a neutral because I feel samsung should incorporate a way to change the lock screen clock by default to a couple preset clocks. The standard one IMHO, is ugly and not aesthetically pleasing to read. Con's: 1. Typical android settings. Everything is always on. This is not a samsung issue, but android. I recommend going through every single option, and every single app to change every single setting. Sometimes, this can take the first week of owning an android phone to get right. This also almost always has a HUGE impact on battery life. There are settings in sub-menu's of settings. So please, NAVIGATE YOUR ANDROID SETTINGS! Your poor battery life is not due to this phone at all. It is due to negligence and laziness. 2. \"Ok Google\". This seems to always be on, even when turned off in googles settings. I have a search bar and I have turned off all settings both in the phone and google, but for some reason if you say those two naughty words, it still comes up. However, if you do not set it up, it will only be asking you to set it up. Same thing as bixby almost, but this is a negative because I do not want my mic on. At all. I think samsung needs to address this before anything else, even the bixby issues some people are not liking or failing to change. 3. All glass. The phone is not strong by any means. It does not feel like a cheap POS, but it is all glass. This belongs in the negative because most of us are drop prone, and even if you are not, it is very easy to make a mistake. Overall, it looks amazing, but there is no need for a glass backing too. I highly recommend you get a case, and if you are in fact drop prone, get a big durable case like an otterbox with a screen protector. The risk will always be there with all smart phones, but the s8 being all glass just seems pointless. That said, I have NEVER dropped a phone to a point where it broke (fingers crossed, knock on wood). 4. The finger print scanner. What a stupid placement for a finger print scanner. Right next to the camera lense? come on... I personally do not use it at all, but if I did and wanted to take a picture, you would be cleaning your lense as soon as you unlocked it. Nobody wants to take an unclear photo because they used the finger print security feature. I like the Google Plus one, but feel that if any, Apple has the best one being in the home button. On a side note: THIS PHONE IS UNLOCKED. It can be used with ANY carrier. If you do not pay attention to who or where you buy it from, at least leave a sellers review instead of a product review. 99% of the negative reviews are this. Please pay attention and buy a new phone from Amazon only. I do not ever recommend getting a refurb on this kind of product, or buying from a private seller regardless of their rating. You just never know. As for Bixby, all you have to do is not set it up and hold the home screen like you are adding a widget, scroll to the left and hit the button to turn it off. This will not remove it, but will stop it from doind whatever crazy stuff these other reviews are talking about. I have had NO ISSUES with bixby, because I turned it off. Also, make sure you go through your settings, including the subsettings imbedded into android like background data usage etc etc and turn it all off. People having battery issues, I guarantee it is not the s8's fault. It is android and you would not get any better life with iOS for failing to go through your settings. GO THROUGH YOUR SETTINGS! every. single. one. Over and over for a week until you find every nook and cranny. There is a lot! Overall, this phone is amazing. The list of pro's, con's, and neutral's are simply my take and my opinion. I do recommend the phone. At least if you are in a position to think about it and can try it, go to a local store and pick one up on the display to play with it, but it's just not the same as owning it. I was torn between a google pixel xl and this one, but when this dropped in price it made my decision that much easier. I did like the idea of a bigger phone, however, I just kept thinking how big it would be in my pocket. So I went with the standard s8 and I am very happy I did. I do a lot of fishing, hiking, and outdoor stuff and 90% of the time, I TRY to keep my phone around me in my pocket in case of an emergency. Usually off, because where I go there is no signal anyways. Any review stating a mostly negative opinion, in my opinion, is probably a bit trollish or did not do any research and made an impulse buy. I think you can get used to this phone and if you are complaining about the things I have outlined here, the only one to blame is you. So give it a try, navigate ALL the settings, get used to android, and don't drop this phone lol! Thank you for reading.", 
                "review_comment_count": "17", 
                "review_posted_date": "06 Aug 2017", 
                "review_rating": "5.0 ", 
                "review_author": " B.D."
            }, 
            {
                "review_header": "The Pros & Cons", 
                "review_text": "My wife and I have had the Samsung S8+ for a little over a week now. I am an avid Samsung Galaxy user, and have been using them since the 4th generation. Here are the pros and cons as I see them to this device. Pros: - Android Nougat is a very smooth OS. It's a definite upgrade from the previous versions. Just keeps getting better. - The cameras on this phone are both amazing. Makes great photos! - Very slick design on phone, aesthetically speaking. It looks very nice. - Comes with a nice variety of accessories, including adapters for charging in case you want to use a micro-USB charger or want to hook up a USB cable accessory for any reason. - Extremely good graphics on this device. Resolution is phenomenal. - Wide range of settings for customizing your user experience and security. (Even more than the usual for an Android/Samsung device) - Continued to allow for external storage, unlike the S6, which made me very happy. - I haven't put the water resistance to the test, but I'm assuming it's as good as the last model. Glad it's there. - The full screen layout is very nice for movies and gaming. I adjusted to the homescreen button being part of the screen almost instantly. Cons: - This is an EXTREMELY fragile design, especially the back of the phone, which is also coated in the Gorilla Glass, from what I can tell. My wife dropped hers from about 10 inches, with a case on, on the 5th day of ownership. The back of the phone cracked, chipped, and spider-webed all over within just a few hours. The phone was insured through our carrier, but the cheapest solution was to send it in to Samsung for a $75 repair job (plus shipping and handling). I would strongly recommend using a reputable case and screen protector at all costs. And be sure you insure this device. Lots of the durability tests that I have seen on YouTube have exposed this design flaw as well. - The headphones that come with the phone aren't that great. In previous editions, they provided Samsung-brand headphones that sounded great. It looks like they've started using another company to produce their headphones. There is very little bass or mid-range in the sound, so if you use your headphones for music, gaming, or videos, be prepared to get a better brand. - The new Bixby application via Samsung... I'm still trying to adjust to it. It's Samsung's version of Google Assistant/Siri. It's not that it's not a useful concept, but you don't get much of a choice but to use it. There's a dedicated button on the left of the phone that can not be deactivated from what I can tell. It's right below the volume button and is easy to press unknowingly and can get annoying quickly. I hope Bixby grows on me. - The voice command features for both Google and Bixby is weak in this edition. I have had to reprogram my voice recognition settings about 5 times already, and it still only picks up the commands about 30% of the time. Oddly enough, it works much better for the Bixby service than the Google Assistant service. (That struck me as a bit suspicious) - The speech-to-text application in general took a step backwards with this edition. My S7 and S6 both did a wonderful job for the most part of translating my speech. This phone, however, has massive errors in its translation. It hyphenates words that don't need to be and substitutes words incorrectly, and often. I have to speak EXTREMELY slowly and phonetically in order to get it to work. The fact that I have a Southern accent doesn't help whatsoever. This was one of the worst drawbacks for me, personally, because I use the speech-to-text feature often with my work. Overall: It's a gorgeous phone with some definite upgrades but concerning drawbacks. If I were Samsung, I would put a lot of emphasis on making a more durable design on the future editions. Worth buying - just keep it well protected.", 
                "review_comment_count": "3", 
                "review_posted_date": "22 Jul 2017", 
                "review_rating": "3.0 ", 
                "review_author": " McGrad"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "16%", 
            "4 star": "12%", 
            "3 star": "7%", 
            "5 star": "60%"
        }, 
        "price": "$574.99", 
        "url": "http://www.amazon.com/dp/B06Y14T5YW", 
        "name": "Samsung Galaxy S8 Unlocked 64GB - US Version (Midnight Black)"
    }
]